["The day is warm, yet there is a cooling breeze. The latest in a series of personal crises seems insurmountable. You are being pulled apart in all directions.","Yet this afternoon walk in the country- side slowly brings relaxation to your harried mind. The soil and strain of modern high-tech living begins to wash off in layers. That willow tree near the stream looks comfortable and inviting.","The buzz of dragonflies and the whisper of the willow's swaying branches bring a deep peace. Searching inward for tranquility and happiness, you close your eyes.","A high-pitched cascading sound like crystal wind-chimes impinges on your floating awareness. As you open your eyes, you see a shimmering blueness rise from the ground. The sound seems to be emanating from this glowing portal.","It is difficult to look at the blueness. Light seems to bend and distort around it, while the sound waves become so intense, they appear to become visible.","The portal hangs there for a moment; then, with the rush of an imploding vacuum, it sinks into the ground. Something remains suspended in mid-air for a moment before falling to earth with a heavy thud.","Somewhat shaken by this vision, you rise to your feet to investigate. A crude circle of stones surrounds the spot where the portal appeared. There is something glinting in the grass.","You pick up an amulet shaped like a cross with a loop at the top. It is an Ankh, the sacred symbol of life and rebirth. But this could not have made the thud, so you look again and find a large book wrapped in thick cloth!","With trembling hands you unwrap the book. Behold, the cloth is a map, and within lies not one book, but two. The map is of a land strange to you, and the style speaks of ancient cartography.","The script on the cover of the first book is arcane but readable. The title is: The History of Britannia as told by Kyle the Younger","The other book is disturbing to look at. Its small cover appears to be fashioned out of some sort of leathery hide, but from what creature is uncertain. The reddish-black skin radiates an intense aura suggestive of ancient power.","The tongue of the title is beyond your ken. You dare not open the book and disturb whatever sleeps within. You decide to peruse the History. Settling back under the willow tree, you open the book.","(You read the Book of History)","(No, really! Read the Book of History!)","Closing the book, you again pick up the Ankh. As you hold it, you begin to hear a hauntingly familiar, lute-like sound wafting over a nearby hill. Still clutching the strange artifacts, you rise unbidden and climb the slope.","In the valley below you see what appears to be a fair. It seems strange that you came that way earlier and noticed nothing. As you mull this over, your feet carry you down towards the site.","This is no ordinary travelling carnival, but a Renaissance Fair. The pennants on the tent tops blow briskly in the late afternoon breeze.","The ticket taker at the RenFair's gate starts to ask you for money, but upon spotting your Ankh says, \"Welcome, friend. Enter in peace and find your path.\"","The music continues to pull you forward amongst the merchants and vendors. Glimpses of fabulous treasures can be seen in some of the shadowy booths.","These people are very happy. They seem to glow with an inner light. Some look up as you pass and smile, but you cannot stop - the music compels you to move onward through the crowd.","Through the gathering dusk you see a secluded gypsy wagon sitting off in the woods. The music seems to emanate from the wagon. As you draw near, a woman's voice weaves into the music, saying: \"You may approach, O seeker.\"","You enter to find an old gypsy sitting in a small curtained room. She wears an Ankh around her neck. In front of her is a round table covered in deep green velvet. The room smells so heavily of incense that you feel dizzy.","Seeing the Ankh, the ancient gypsy smiles and warns you never to part with it. \"We have been waiting such a long time, but at last you have come. Sit here and I shall read the path of your future.\"","Upon the table she places a curious wooden object like an abacus but without beads. In her hands she holds eight unusual cards. \"Let us begin the casting.\""]