["Entrusted to deliver an uncounted purse of gold, thou dost meet a poor beggar. Dost thou A) deliver the gold knowing the Trust in thee was well placed, or B) show Compassion, giving the beggar a coin, knowing it won't be missed?","Thou has been prohibited by thy absent Lord from joining thy friends in a close pitched battle. Dost thou A) refrain, so thou may Honesty claim obedience, or B) show Valor, and aid thy comrades, knowing thou may deny it later?","A merchant owes thy friend money, now long past due. Thou dost see the same merchant drop a purse of gold. Dost thou A) Honestly return the purse intact, or B) Justly give thy friend a portion of the gold first?","Thee and thy friend are valiant but penniless warriors. Thou both go out to slay a mighty dragon. Thy friend thinks he slew it; thee did. When asked, dost thou A) Truthfully claim the gold, or B) Allow thy friend the large reward?","Thou art sworn to protect thy Lord at any cost, yet thou know he hath committed a crime. Authorities ask thee of the affair. Dost thou A) break thine oath by Honestly speaking, or B) uphold Honor by silently keeping thine oath?","Thy friend seeks admittance to thy Spiritual order. Thou art asked to vouch for his purity of Spirit, of which thou art unsure. Dost thou A) Honestly express thy doubt, or B) Vouch for him hoping for his Spiritual improvement?","Thy Lord mistakenly believes he slew a dragon. Thou hast proof that thy lance felled the beast. When asked, dost thou A) Honestly claim the kill and the prize, or B) Humbly permit thy Lord his belief?","Thou dost manage to disarm thy mortal enemy in a duel. He is at thy mercy. Dost thou A) show Compassion by permitting him to yield, or B) slay him as expected of a Valiant duelist?","After 20 years thou hast found the slayer of thy best friends. The villain proves to be a man who provides the sole support for a young girl. Dost thou A) spare him in Compassion for the girl, or B) slay him in the name of Justice?","Thee and thy friends have been routed and ordered to retreat. In defiance of thy orders, dost thou A) stop in Compassion to aid a wounded companion, or B) Sacrifice thyself to slow the pursuing enemy, so others may escape?","Thou art sworn to uphold a Lord who participates in the forbidden torture of prisoners. Each night their cries of pain reach thee. Dost thou A) show Compassion by reporting the deeds, or B) Honor thy oath and ignore the deeds?","Thou hast been taught to preserve all life as sacred. A man lies fatally stung by a venomous serpent. He pleads for a merciful death. Dost thou A) show Compassion and end his pain, or B) heed thy Spiritual beliefs and refuse?","As one of the King's Guard, thy Captain has asked that one amongst you visit a hospital to cheer the children with tales of thy valiant deeds. Dost thou A) Show thy Compassion and play the braggart, or B) Humbly let another go?","Thou hast been sent to secure a needed treaty with a distant Lord. Thy host is agreeable to the proposal but insults thy country at dinner. Dost thou A) Valiantly bear the slurs, or B) Justly rise and demand an apology?","A mighty knight accosts thee and demands thy food. Dost thou A) Valiantly refuse and engage the knight, or B) Sacrifice thy food unto the hungry knight?","During battle thou art ordered to guard thy commander's empty tent. The battle goes poorly and thou dost yearn to aid thy fellows. Dost thou A) Valiantly enter the battle to aid thy companions, or B) Honor thy post as guard?","A local bully pushes for a fight. Dost thou A) Valiantly trounce the rogue, or B) Decline, knowing in thy Spirit that no lasting good will come of it?","Although a teacher of music, thou art a skillful wrestler. Thou hast been asked to fight in a local championship. Dost thou A) accept the invitation and Valiantly fight to win, or B) Humbly decline knowing thou art sure to win?","During a pitched battle, thou dost see a fellow desert his post, endangering many. As he flees, he is set upon by several enemies. Dost thou A) Justly let him fight alone, or B) Risk Sacrificing thine own life to aid him?","Thou hast sworn to do thy Lord's bidding in all. He covets a piece of land and orders the owner removed. Dost thou A) serve Justice refusing to act, thus being disgraced, or B) Honor thine oath and unfairly evict the landowner?","Thou dost believe that virtue resides in all people. Thou dost see a rogue steal from thy Lord. Dost thou A) call him to Justice, or B) personally try to sway him back to the Spiritual path of good?","Unwitnessed, thou hast slain a great dragon in self defense. A poor warrior claims the offered reward. Dost thou A) Justly step forward to claim the reward, or B) Humbly go about life, secure in thy self esteem?","Thou art a bounty hunter sworn to return an alleged murder. After his capture thou believest him to be innocent. Dost thou A) Sacrifice thy sizable bounty for thy belief, or B) Honor thy oath to return him as thou hast promised?","Thou hast spent thy life in charitable and righteous work. Thine uncle the innkeeper lies ill and asks you to take over his tavern. Dost thou A) Sacrifice thy life of purity to aid thy kin, or B) decline & follow thy Spirit's call?","Thou art an elderly, wealthy eccentric. Thy end is near. Dost thou A) donate all thy wealth to feed hundreds of starving children, and receive public adulation, or B) Humbly live out thy life, willing thy fortune to thy heirs?","In thy youth thou pledged to marry thy sweetheart. Now thou art on a sacred quest in distant lands. Thy sweetheart asks thee to keep thy vow. Dost thou A) Honor thy pledge to wed, or B) follow thy Spiritual crusade?","Thou art at a crossroads in thy life. Dost thou A) Choose the Honorable life of a Paladin, striving for Truth and Courage, or B) Choose the Humble life of a Shepherd, and a world of simplicity and peace?","Thy parents wish thee to become an apprentice. Two positions are available. Dost thou A) Become an acolyte in the Spiritual order, or B) Become an assistant to a humble village cobbler?"]